Repository: NikolaiBorisov/Determinant
Catalog: Determinant/View/*.lproj/Localizable.strings
Languages: ru

source: Player (+)
ru: Ходит игрок (+)

source: Player (-)
ru: Ходит игрок (-)

source: Determinant = 0. Draw!🤝
ru: Детерминант = 0. Ничья!🤝

source: Determinant = . Player(+) Won 🏆
ru: Детерминант = Победил Игрок(+) 🏆

source: Determinant = . Player(-) Won 🏆
ru: Детерминант = Победил Игрок(-) 🏆

source: Welcome to the Game «Determinant»
ru: Добро пожаловать в игру «Детерминант»

source: Read the Instruction
ru: Читать правила

source: Game
ru: Игра

source: 1st Player, choose the Sign 👇🏻
ru: Первый игрок, выберите знак👇🏻

source: 2nd Player, choose the Sign 👇🏻
ru: Второй игрок, выберите знак👇🏻

source: +Choose the Sign-
ru: +Выберите знак-

source: Matrix 3x3
ru: Матрица 3х3

source: More about Matrix 3x3
ru: Узнать больше

source: 1. Main Diagonal = (a11a22a33)+(a12a23a31)+(a13a21a32) 2. Secondary Diagonal = (a13a22a31) - (a12a21a33) - (a11a23a32) 3. Determinant = Main Diagonal - Secondary Diagonal
ru: 1. Главная диагональ = (a11a22a33)+(a12a23a31)+(a13a21a32) 2. Вторичная диагональ = (a13a22a31) - (a12a21a33) - (a11a23a32) 3. Детерминант = Главная диагональ - Вторичная диагональ
